app/Controllers/Mahasiswa.php

  public function index()
  {
    $data = [
      'title' => 'Home | Datatables',
      'prodi' => $this->prodi->findAll()
---
SELECT *
FROM `tb_prodi`