app/Models/MahasiswaModel.php

    public function TambahDataMahasiswa($simpandata)
    {
        return $this->db->table('tb_mhs')->insert($simpandata);
---
INSERT INTO `tb_mhs` (`nama`, `nim`, `jen_kel`, `kelas`, `prodi`, `foto`) VALUES ('Akbar Ramadhan Rusdi', '2005112046', 'L', 'CE-6B', '1', 'default.jpg')